Autodesk.Revit.UI.RibbonItem.SetContextualHelp(Autodesk.Revit.UI.ContextualHelp)
Sets the contextual help bound with this button.
contextualHelp: The contextual help.
Since: 2013

Autodesk.Revit.UI.RibbonItem.GetContextualHelp
Gets the contextual help bound with this control.
Returns: The contextual help assigned to the item, or null if there is no binding assigned.
Since: 2013

Autodesk.Revit.UI.RibbonItem.Equals(System.Object)
Determines whether the specified System.Object is equal to the current System.Object.
obj:  Another panel object.

Autodesk.Revit.UI.RibbonItem.ItemType
Gets the item type.

Autodesk.Revit.UI.RibbonItem.Visible
Gets or sets a value indicating whether the item is visible.
Remarks: When the Visible property is set to false, the item won't be displayed on Ribbon.
Since: 2011

Autodesk.Revit.UI.RibbonItem.Enabled
Gets or sets a value indicating whether the item is enabled.
Remarks: When the Enabled property is set to false, the item cannot be clicked,
and the item's appearance changes. The Image and Text assigned to the item appear grayed
out. For pushbuttons, the button may be enabled programmatically but be disabled in the user interface
because of the Revit context; see the property IsEnabledByContext for RibbonButton.

Autodesk.Revit.UI.RibbonItem.ToolTipImage
The image to show as a part of the button extended tooltip
Remarks:  Shown when the cursor hovers over the command.
If neither this property nor LongDescription is supplied, the button will not have
an extended tooltip. Maximum height or width is 355 pixels.
SplitButton and RadioButtonGroup cannot display the tooltip set by this method. SplitButton
shows the current PushButton tooltip and RadioButtonGroup has no tooltip.

Autodesk.Revit.UI.RibbonItem.LongDescription
Long description of the command tooltip
Remarks:  It will be used as part of the button's extended
tooltip. This tooltip is shown when the mouse hovers over the command for a long amount
of time. You can split the text of this option into multiple paragraphs by placing <p>
tags around each paragraph. Optional. If neither of this property and TooltipImage is
supplied, the button will not have an extended tooltip.
SplitButton and RadioButtonGroup cannot display the tooltip set by this method, the SplitButton will
always show the current PushButton tooltip, and RadioButtonGroup has no tooltip.

Autodesk.Revit.UI.RibbonItem.ToolTip
The description that appears as a ToolTip for the item.
Remarks: The text that is displayed when the mouse pointer moves over the item.
SplitButton and RadioButtonGroup cannot display the tooltip set by this method, the SplitButton will
always show the current PushButton tooltip, and RadioButtonGroup has no tooltip.

Autodesk.Revit.UI.RibbonItem.ItemText
Gets or sets the text displayed on the item.
Remarks: The text can be changed at run time. null or empty string is not allowed.
Throws Autodesk.Revit.Exceptions.ArgumentException:  Thrown when setting the text to empty or to the string contains "%".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:  Thrown when setting the text to null.

Autodesk.Revit.UI.RibbonItem.Name
The name of the item.
Throws Autodesk.Revit.Exceptions.ArgumentException:  Thrown when setting the text to empty or to the string contains "%".

Autodesk.Revit.UI.RibbonItem
The RibbonItem object represents an item on RibbonPanel, can be a push-button or a pull-down
which should contain the information for creating one RibbonItem.
Remarks: This class is not supported in Revit Macros.